"""
Вие сте собственик на online магазин, и искате да проверите в кои дни и часове има
 най-много продажби. Най-много продажби означава сумата на тези продажби, не броят на извършените продажби.

Свалете файла sales.csv, който съдържа 1000 продажби. Файлът е CSV като 
първата колона е датата и часа на продажбата, втората колона е сумата на продажбата. Файлът не е подреден.

Напишете код, който показва в кой ден е имало най-много продажби като
 сума от всички продажби за този ден.

Пример: В понеделник е имало продажби за 2000 лева, във вторник за 2345 лева,
 а в сряда за 897 лева. Денят с най-много продажби е вторник.

Разширение на задачата
Разширете кода си, така че да показва в кой час има най-много продажби. 
Интересува ни часа, а не деня.

Пример: За целия период между 13:00 и 14:00 е имало продажби за 897 лева,
 между 14:00 и 15:00 е имало продажби за 456 лева. Между 13:00 и 14:00 е имало повече продажби отколкото между 14:00 и 15:00
"""

with open('sales.csv', 'r') as lines:
	dates_sales =dict()
	for line in lines:
		line = line.split(' ')
		tmp = line[1].split(',')
		result = []
		result.append(line[0])
		result.append(tmp[0])
		result.append(float(tmp[1]))
		if(result[0] in dates_sales):
			dates_sales[result[0]] += result[-1]
		else:
			dates_sales[result[0]] = 0
print(dates_sales)
print(max(dates_sales, key = dates_sales.get))